Autodesk.Revit.UI.RecentFileProvider.TogglePin(System.String)
toggle the pin status of recent files, only call it for UDA home
name:
Name of the recent doc
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.RecentFileProvider.GetDefaultLocalSavingFolder
Returns the default saving folder when open a central file.
Since:
2019

Autodesk.Revit.UI.RecentFileProvider.IsRecentFilePageDisabled
Indicates if recent file is disabled.
Returns:
Returns true if recent file is disabled, otherwise returns false.
Since:
2019

Autodesk.Revit.UI.RecentFileProvider.GetAllRecentAndSampleFiles(System.Boolean,System.Boolean)
generateThumbnails:
true to generate and return thumbnails paths as part of return, false to leave blank.
withPinStatus:
true to get pin status as part of return, false to leave blank.
Since:
2025

Autodesk.Revit.UI.RecentFileProvider.GetAllSampleFiles
Returns sample files of Revit
Since:
2019

Autodesk.Revit.UI.RecentFileProvider.GetAllRecentFiles(System.Boolean)
Returns most recent files of Revit
generateThumbnails:
true to generate and return thumbnails paths as part of return, false to leave blank.
Since:
2019

Autodesk.Revit.UI.RecentFileProvider
A class contains data of Most Recent File .
Since:
2019